<a href="https://colab.research.google.com/github/leoberDr/taller3_PLE/blob/main/tablas_version2R.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
conos <- data.frame(
  Sabor = c("mora", "vainilla", "chocolate", "mora", "chocolate"),
  precio = c(3500, 4700, 6500, 5200, 5700)
)

print(conos)

      Sabor precio
1      mora   3500
2  vainilla   4700
3 chocolate   6500
4      mora   5200
5 chocolate   5700

In [ ]:
conos$Sabor

[1] "mora"      "vainilla"  "chocolate" "mora"      "chocolate"

In [ ]:
conos$precio

[1] 3500 4700 6500 5200 5700

In [ ]:
conos [ c("Sabor", "precio")]

  Sabor     precio
1 mora      3500
2 vainilla  4700
3 chocolate 6500
4 mora      5200
5 chocolate 5700

In [ ]:
conos[order(conos$Sabor, decreasing = TRUE), ]

  Sabor     precio
2 vainilla  4700
1 mora      3500
4 mora      5200
3 chocolate 6500
5 chocolate 5700

In [ ]:
head(conos, 2)

  Sabor    precio
1 mora     3500
2 vainilla 4700

In [ ]:
tail(conos, 1)

  Sabor     precio
5 chocolate 5700

In [ ]:
sample(conos)

  Sabor     precio
1 mora      3500
2 vainilla  4700
3 chocolate 6500
4 mora      5200
5 chocolate 5700

In [ ]:
conos[sample(nrow(conos), 1), ]

  Sabor precio
4 mora  5200

In [ ]:
summary(conos)

    Sabor               precio
 Length:5           Min.   :3500
 Class :character   1st Qu.:4700
 Mode  :character   Median :5200
                    Mean   :5120
                    3rd Qu.:5700
                    Max.   :6500

In [ ]:
str(conos)

'data.frame':	5 obs. of  2 variables:
 $ Sabor : chr  "mora" "vainilla" "chocolate" "mora" ...
 $ precio: num  3500 4700 6500 5200 5700

In [ ]:
row.names(conos)

[1] "1" "2" "3" "4" "5"

In [ ]:
conos[4,]

  Sabor precio
4 mora  5200

In [ ]:
conos$precio[3]

[1] 6500

In [ ]:
rownames(conos) <- make.unique(as.character(conos$Sabor))
conos

            Sabor     precio
mora        mora      3500
vainilla    vainilla  4700
chocolate   chocolate 6500
mora.1      mora      5200
chocolate.1 chocolate 5700

In [ ]:
resultado <- conos[conos$precio > 5000, ]


resultado

            Sabor     precio
chocolate   chocolate 6500
mora.1      mora      5200
chocolate.1 chocolate 5700

In [ ]:
resultado2 <- conos[conos$precio > 3000 & conos$precio < 5000, ]
resultado2

         Sabor    precio
mora     mora     3500
vainilla vainilla 4700

In [ ]:
resultado_chocolate <- conos[conos$Sabor == "chocolate" & conos$precio < 6000, ]
resultado_chocolate

            Sabor     precio
chocolate.1 chocolate 5700

#segunda parte de tablas en R

In [ ]:
valoracion <- data.frame(
  Tipo = c("mora", "chocolate", "vainilla"),
  Calificacion = c(2.5, 3.5, 4.0)
)


valoracion

  Tipo      Calificacion
1 mora      2.5
2 chocolate 3.5
3 vainilla  4.0

#Marge

In [ ]:
tabla_comple <- merge(conos, valoracion, by.x = "Sabor", by.y = "Tipo")
tabla_comple

  Sabor     precio Calificacion
1 chocolate 6500   3.5
2 chocolate 5700   3.5
3 mora      3500   2.5
4 mora      5200   2.5
5 vainilla  4700   4.0

In [ ]:
tabla_comple <- merge(conos, valoracion, by.x = "Sabor", by.y = "Tipo")


tabla_comple$Tipo <- NULL

tabla_comple

  Sabor     precio Calificacion
1 chocolate 6500   3.5
2 chocolate 5700   3.5
3 mora      3500   2.5
4 mora      5200   2.5
5 vainilla  4700   4.0

#column precio/calificacion

In [ ]:
tabla_comple$`precio/calificacion` <- tabla_comple$precio / tabla_comple$Calificacion


tabla_comple

  Sabor     precio Calificacion precio/calificacion
1 chocolate 6500   3.5          1857.143
2 chocolate 5700   3.5          1628.571
3 mora      3500   2.5          1400.000
4 mora      5200   2.5          2080.000
5 vainilla  4700   4.0          1175.000

#.join

#where

In [ ]:
tabla_comple[tabla_comple$Sabor == "vainilla", ]

  Sabor    precio Calificacion precio/calificacion
5 vainilla 4700   4            1175

#nuevo dataframe

In [ ]:
# Crear el data.frame en R
helados <- data.frame(
  Sabor = c("mora", "vainilla", "chocolate", "mora", "chocolate", "vainilla"),
  precio = c(3500, 4700, 6500, 5200, 5700, 4800),
  Ciudad = c("Bogotá", "Bogotá", "Cali", "Medellin", "Bogotá", "Cali")
)

# Mostrar el data.frame
helados

  Sabor     precio Ciudad
1 mora      3500   Bogotá
2 vainilla  4700   Bogotá
3 chocolate 6500   Cali
4 mora      5200   Medellin
5 chocolate 5700   Bogotá
6 vainilla  4800   Cali

#equivalente a groupby

In [ ]:
mean_precio_por_sabor <- aggregate(precio ~ Sabor, data = helados, FUN = mean)


mean_precio_por_sabor

  Sabor     precio
1 chocolate 6100
2 mora      4350
3 vainilla  4750

#conteo de ciudades

In [ ]:
conteo <- table(helados$Ciudad)

# Mostrar el resultado
conteo

  Bogotá     Cali Medellin
       3        2        1

In [ ]:
preciomax <- aggregate(precio ~ Ciudad, data = helados, FUN = max)

preciomax

  Ciudad   precio
1 Bogotá   5700
2 Cali     6500
3 Medellin 5200

#precio total por sabor

In [ ]:
suma_sabor <- aggregate(precio ~ Sabor, data = helados, FUN = sum)

suma_sabor

  Sabor     precio
1 chocolate 12200
2 mora       8700
3 vainilla   9500

#suma [pr ciudad

In [ ]:
suma_ciudad <- aggregate(precio ~ Ciudad, data = helados, FUN = sum)

suma_ciudad

  Ciudad   precio
1 Bogotá   13900
2 Cali     11300
3 Medellin  5200

#datos 'mean', 'max', 'min', 'count']

In [ ]:
datospro <- aggregate(precio ~ Sabor, data = helados, FUN = function(x) c(mean = mean(x), max = max(x), min = min(x), count = length(x)))

datospro

  Sabor     precio
1 chocolate 6100, 6500, 5700, 2
2 mora      4350, 5200, 3500, 2
3 vainilla  4750, 4800, 4700, 2

In [ ]:
datospro <- aggregate(precio ~ Sabor, data = helados, FUN = function(x) c(mean = mean(x), max = max(x), min = min(x), count = length(x)))

datospro

#nuevo dataframe

In [ ]:
datos <- data.frame(
  Nombre = c("ana", "luis", "carlos", "marta", NA),
  Edad = c(25, NA, 30, 22, 28),
  Ciudad = c("Bogotá", "Cali", NA, "Medellin", "Cali"),
  stringsAsFactors = FALSE
)


datos

  Nombre Edad Ciudad
1 ana    25   Bogotá
2 luis   NA   Cali
3 carlos 30   NA
4 marta  22   Medellin
5 NA     28   Cali

#dropna

In [ ]:
na.omit(datos)

  Nombre Edad Ciudad
1 ana    25   Bogotá
4 marta  22   Medellin

In [ ]:
datos[!is.na(datos$Edad), ]

  Nombre Edad Ciudad
1 ana    25   Bogotá
3 carlos 30   NA
4 marta  22   Medellin
5 NA     28   Cali